tutorials/Taylor-Green/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       simpleFoam;

startFrom         startTime;

startTime         0;

stopAt            endTime;

endTime           10000;

deltaT            1;

writeControl      runTime;

writeInterval     10000;

purgeWrite        0;

writeFormat       ascii;

writePrecision    10;

writeCompression  uncompressed;

timeFormat        general;

timePrecision     8;

runTimeModifiable true;

adjustTimeStep    no;

maxCo             0.999;

libs
(
    "libcomputeErrors.so"
);

functions
{
}

// ************************************************************************* //
