tutorials/Taylor-Green/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(.*)"
    {
        type            zeroGradient;

        //type            codedMixed;

        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 0;
        name            mixedp;

        codeOptions
        #{
            -I$(PWD)/../../analytic/include
        #};

        code
        #{
            const vectorField& Cf = this->patch().Cf();
            tmp<vectorField> nf = this->patch().nf();

            forAll(Cf, i)
            {
                const scalar& x = Cf[i][0];
                const scalar& y = Cf[i][1];
                const scalar& z = Cf[i][2];
                #include "gradpx.H"
                #include "gradpy.H"
                #include "gradpz.H"
                this->refGrad()[i] = vector(gradpx, gradpy, gradpz) & nf()[i];
                this->valueFraction()[i] = 0.0;
            }
        #};
    }

    "(INLET|OUTLET)"
    {
        type            empty;
    }
}

// ************************************************************************* //
