tutorials/Taylor-Green/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-03;
            relTol          0;
            smoother        DICGaussSeidel;
            cacheAgglomeration no;
        }
        tolerance       1e-5;
        relTol          1e-5;
        maxIter         1000;
    }
    pFinal
    {
        $p;
        relTol          0;
    }
    "pcorr.*"
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          1e-5;
    }
    UFinal
    {
        $U;
        relTol          0;
    }
}


SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent          yes;
    pRefCell            0;
    pRefValue           0;

    residualControl
    {
       U    1e-5;
       p    1e-5;
    }
}


relaxationFactors
{
    fields
    {
        p               1.0;
    }
    equations
    {
        U               0.8;
    }
}


cache
{}



// ************************************************************************* //
